USE [ChatDb]
GO

INSERT INTO [dbo].[Message]
           ([Id],
		   [TextMessage]
           ,[DateMessage]
           ,[userId]
           ,[roomId],
		   [DeleteForUser])
     VALUES
           ('d23ds4564dsfd',
		   'Привіт'
           ,'2022-09-05 10:10:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3
		   ,0),

		   ('d23dd5467dsfd',
		   'Привіт'
           ,'2022-09-05 10:11:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('dg3d4356sdsfd',
		   'Щось потрібно?'
           ,'2022-09-05 10:12:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('d23ds7435hsfd',
		   'Та да. Яка там фотографія потрібна для заяви?'
           ,'2022-09-05 10:13:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('l23ds35678dsfd',
		   'Фотографія як на документи тобто 3x4'
           ,'2022-09-05 10:14:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),
		   ('d23ds8356dsfp',
		   'А!'
           ,'2022-09-05 10:15:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('d23ds7435dasd',
		   'Дякую'
           ,'2022-09-05 10:16:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('dasdd24567sdsfd',
		   'Ще щось потрібно?'
           ,'2022-09-05 10:17:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('0sdfd765sdsfd',
		   'Та ні! Спасибі'
           ,'2022-09-05 10:18:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('d01234567sdsfd',
		   'Ну тоді давай удачі!'
           ,'2022-09-05 10:19:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('d23054671022d',
		   'Давай! Удачі'
           ,'2022-09-05 10:20:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('d21546723psdsfd',
		   'Ага'
           ,'2022-09-05 10:21:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('0sdfds6644567565sfd',
		   'Привіт! Діло срочне не підскажеш в що можна пограти?'
           ,'2022-10-05 10:18:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('d0134556723sdsfd',
		   'Привіт!'
           ,'2022-10-05 10:19:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),
		   

		   ('d01345232345sdsfd',
		   'В Козаки 3 можна зіграти.'
           ,'2022-10-05 10:20:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('d2302453346321022d',
		   'О точно!'
           ,'2022-10-05 10:21:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('d2302654346321022d',
		   'Дякую!'
           ,'2022-10-05 10:22:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,3,0),

		   ('d2123ps8562772dsfd',
		   'Та ні за що...'
           ,'2022-11-05 10:23:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,3,0),

		   ('d2123ps8562342772dsfd',
		   'Всім привіт!'
           ,'2022-11-05 10:24:10'
           ,'c71c2dcf-f540-45e4-85d0-524a6b0503a9'
           ,1,0),

		   ('d21235123ps8562772dsfd',
		   'Йо.'
           ,'2022-11-05 10:25:10'
           ,'d03d50c4-533e-4ff0-8618-a0ecb8a0b820'
           ,1,0),

		   ('d21235132ps8562772dsfd',
		   'Агась. Привіт.'
           ,'2022-11-05 10:26:10'
           ,'f4c2d385-12f7-43a1-8fd4-ad3e46610637'
           ,1,0),

		   ('fgdg35123ps8562772dsfd',
		   'Я дуже хочу на стажування...'
           ,'2022-11-05 10:25:10'
           ,'84b3d539-932b-4fa5-9859-8451673752b5'
           ,4,0),

		   ('d21235sfh2ps8562772dsfd',
		   'Я тоже...'
           ,'2022-11-05 10:26:10'
           ,'f4c2d385-12f7-43a1-8fd4-ad3e46610637'
           ,4,0)



GO


